init.org
** Package Manager & Package Sources

To manage downloaded packages, Emacs comes with =package.el= installed. In
addition, I want to use =use-package=, so let's make sure we have those loaded.

#+begin_src emacs-lisp
(require 'package)
(require 'use-package)
(require 'use-package-ensure)
(setq use-package-always-ensure t)
#+end_src

Next, I'll set up my package sources. These are very common and well-maintained mirrors.

#+BEGIN_SRC emacs-lisp
(setq package-archives
      '(("GNU ELPA"     . "https://elpa.gnu.org/packages/")
        ("MELPA"        . "https://melpa.org/packages/")
        ("ORG"          . "https://orgmode.org/elpa/")
        ("MELPA Stable" . "https://stable.melpa.org/packages/")
        ("nongnu"       . "https://elpa.nongnu.org/nongnu/"))
      package-archive-priorities
      '(("GNU ELPA"     . 20)
        ("MELPA"        . 15)
        ("ORG"          . 10)
        ("MELPA Stable" . 5)
        ("nongnu"       . 0)))
(package-initialize)
#+END_SRC

** Init custom bindings keymap

#+begin_src emacs-lisp
(defvar custom-bindings-map (make-sparse-keymap) 
  "Keymap for custom bindings.")

#+end_src

** Version Controling via Magit

Use Magit for version controlling.

#+begin_src emacs-lisp
(use-package magit)
#+end_src

** Project Managing

User Projectile for project managing and recognizing repositories.

#+begin_src emacs-lisp
(use-package projectile
  :ensure t
  :init
  (when (file-directory-p "~/Documents/")
    (setq projectile-project-search-path '("~/Documents/Kompositionen"
					   "~/Documents/Code"
					   "~/Documents/DeterministicJitter"
					   "~/Documents/Reaper"
					   "~/Documenqts/Kompositionen-Video"
					   "~/Documents/Projekte"
					   "~/Documents/Utilities")))
  (setq projectile-switch-project-action #'treemacs)
  :bind-keymap
  ("s-p" . projectile-command-map)
  :config
  (projectile-mode))
#+end_src

** Local Files

# I have a folder with extensions that have been downloaded manually. I'll add these to the =load-path= so Emacs knows where to look for them. My folder is called "local-lisp".

# #+BEGIN_SRC emacs-lisp
# (defvar local-lisp (concat user-emacs-directory "local-lisp/"))
# (add-to-list 'load-path  local-lisp)
# (let ((default-directory local-lisp))
#   (normal-top-level-add-subdirs-to-load-path))
# #+END_SRC

# I'll initialise some lists to an empty list. I'll add to the lists both in =private.el= and further down in this file, so it's important that the variable already exists.

# #+begin_src emacs-lisp
# (setq org-agenda-files '())
# (setq register-alist '())
# (setq projectile-project-search-path '())
# #+end_src

# And add custom settings from =custom.el= and private settings from =private.el= if they exist.

# #+begin_src emacs-lisp
# (add-hook
#  'after-init-hook
#  (lambda ()
#    (let ((init-file (concat user-emacs-directory "init.el"))
#          (private-file (concat user-emacs-directory "private.el"))
# 		 (custom-file (concat user-emacs-directory "custom.el")))
#      (when (file-exists-p private-file)
#        (load-file private-file))
#      (when (file-exists-p custom-file)
#        (load-file custom-file))
#      (server-start))))
# #+end_src

** Dashboard

Start Emacs at the Dashboard Screen.

#+begin_src emacs-lisp
(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)
  :custom
  (dashboard-startup-banner "/Users/philippneumann/.emacs.d/images/emacs-gnu.png")
  (dashboard-banner-logo-title nil)
  (dashboard-center-content t)
  (dashboard-show-shortcuts nil)
(dashboard-display-icons-p t)
  (dashboard-icon-type 'nerd-icons)
  (dashboard-set-heading-icons t)
  (dashboard-set-file-icons t)
  (dashboard-set-footer nil)
  (dashboard-projects-backend 'projectile)
  (dashboard-items '(
		     (recents . 5)
		     (projects . 5)
		     (bookmarks . 5)
		     (agenda . 24))))
#+end_src

** Treemacs for Folder as Trees

#+begin_src emacs-lisp
(use-package treemacs
  :ensure t
  :bind ("C-x C-t" . treemacs)
  :after doom-themes
  :custom
  (treemacs-is-never-other-window t)
  (setq doom-themes-treemacs-theme "doom-colors")
  :hook
  ((treemacs-mode . treemacs-project-follow-mode)
   (treemacs-mode . (lambda () (display-line-numbers-mode 0)))))

(use-package treemacs-nerd-icons
  :ensure t
  :config
  (treemacs-load-theme "nerd-icons"))

#+end_src

* Visuals
** Decluttering

Let's declutter a little. This should have gone into =early-init.el=, but I get
strange compilation warnings (optimiser says there's too much on the stack).

#+begin_src emacs-lisp
(dolist (mode
         '(tool-bar-mode       ;; Remove toolbar
           scroll-bar-mode     ;; Remove scollbars
           menu-bar-mode    ;; Remove menu bar          
	   tooltip-mode))        ;; Remove tooltips
  (funcall mode 0))
#+end_src

This wouldn't go into =early-init= anyways.

#+begin_src emacs-lisp
(setq inhibit-startup-message           t       ;; No startup message
      inhibit-startup-echo-area-message t       ;; No startup message in echo area
      inhibit-startup-screen            t       ;; No default startup screen
      initial-major-mode                'fundamental-mode
      ring-bell-function                'ignore ;; No bell
      cursor-type 'box
	  visible-bell                        t                  ;; Visble bell
      display-time-default-load-average nil     ;; Don't show me load time
      scroll-margin                     0       ;; Space between top/bottom
      use-dialog-box                    nil)    ;; Disable dialog
#+end_src

** Frames & Windows
*** Open in Fullscreen

When I open Emacs, I want it to open maximised and fullscreen by default.

#+BEGIN_SRC emacs-lisp
(add-to-list 'default-frame-alist     '(fullscreen . maximized))
;; (add-hook 'window-setup-hook          'toggle-frame-fullscreen t)  ;; F11
#+END_SRC

*** Spacious Padding

Make some space in in your windows.

#+begin_src emacs-lisp
(use-package spacious-padding
  :ensure t
  :hook (after-init . spacious-padding-mode))
#+end_src

*** Dinstinguish Buffer from Files

Solair mode for colouzring the background of Buffer windows.

#+begin_src emacs-lisp
(defun solaire-mode-real-buffer-custom-p ()
  "Return t if the current buffer is the dashboard or scratch, or is a real (file-visiting) buffer."
  (cond ((string= (buffer-name (buffer-base-buffer)) "*dashboard*") t)        
        ((buffer-file-name (buffer-base-buffer)) t)
        (t nil)))

(use-package solaire-mode
  :ensure t
  :hook (after-init . solaire-global-mode)
  :init (setq solaire-mode-real-buffer-fn #'solaire-mode-real-buffer-custom-p))
#+end_src

*** Change size of window when change buffer

Golden Ration shrinks the inactive buffer to make space for the active one.

#+begin_src emacs-lisp
(use-package golden-ratio
  :ensure t
  :hook (after-init . golden-ratio-mode))
#+end_src

*** Frame Border

I want a small border around the whole frame, because I think it looks nicer.

#+BEGIN_SRC emacs-lisp
(add-to-list 'default-frame-alist '(internal-border-width . 16))
#+END_SRC

Set the titlebar to transparent

#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
#+end_src

Some settings to fringes.

#+begin_src emacs-lisp
(set-fringe-mode 10)                          ;; Set fringe width to 10

(setq-default fringes-outside-margins nil)
(setq-default indicate-buffer-boundaries nil) ;; Otherwise shows a corner icon on the edge
(setq-default indicate-empty-lines nil)       ;; Otherwise there are weird fringes on blank lines

(set-face-attribute 'header-line t :inherit 'default)
#+end_src

I also set some other options. For example, I don't need info in the title bar about which buffer is in focus, since this info is already in the mode line. I found these options in [[https://notes.alexkehayias.com/emacs-natural-title-bar-with-no-text-in-macos/][this blog post]].

#+begin_src emacs-lisp
(when (eq system-type 'darwin)
  ; no title bar
  (add-to-list 'default-frame-alist '(undecorated-round . t))
  ; don't use proxy icon
  (setq ns-use-proxy-icon nil)
  ; don't show buffer name in title bar
  (setq frame-title-format ""))
#+end_src

** Programming-Specific Visuals
*** Styling Delimiters

When coding, I want my delimiters (parentheses, brackets, etc.) to be colourised
in pairs. [[https://github.com/Fanael/rainbow-delimiters/tree/7919681b0d883502155d5b26e791fec15da6aeca][rainbow-delimiters]] does exactly that.

#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode-hook . rainbow-delimiters-mode))
#+end_src

Also, please highlight matching parentheses/delimiters.

#+begin_src emacs-lisp
(show-paren-mode t) ;; Highlight matching parentheses
#+end_src

*** Line Numbers

I activate line-numbers globaly and deactivate it in buffers where i
don't want them.

#+BEGIN_SRC emacs-lisp
;; Disable line numbers for specific modes
(dolist (mode '(prog-mode-hook
                csound-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 1))))

#+END_SRC

** Fonts
*** Default, Fixed, and Variable Fonts

Please note that I scale and set Org-specific faces in the [[#visuals-1][Org > Visuals]] section.

#+begin_src emacs-lisp
(defvar pvn/font-height 180)

(when (eq system-type 'darwin)
  (setq pvn/font-height 180))

(when (member "Inconsolata" (font-family-list))
  (set-face-attribute 'default nil :font "Inconsolata" :height pvn/font-height)
  (set-face-attribute 'fixed-pitch nil :family "Inconsolata"))

(when (member "Open Sans" (font-family-list))
  (set-face-attribute 'variable-pitch nil :family "Open Sans"))
#+end_src

*** Mixed Pitch Fonts

[[https://gitlab.com/jabranham/mixed-pitch][mixed-pitch]] allows you to mix fixed and variable pitched faces in Org and LaTeX mode.

#+begin_src emacs-lisp
(use-package mixed-pitch
  :defer t
  :hook ((org-mode   . mixed-pitch-mode)
         (LaTeX-mode . mixed-pitch-mode)))
#+end_src

