init.el

(require 'package)
(require 'use-package)
(require 'use-package-ensure)
(setq use-package-always-ensure t)

(setq package-archives
      '(("GNU ELPA"     . "https://elpa.gnu.org/packages/")
        ("MELPA"        . "https://melpa.org/packages/")
        ("ORG"          . "https://orgmode.org/elpa/")
        ("MELPA Stable" . "https://stable.melpa.org/packages/")
        ("nongnu"       . "https://elpa.nongnu.org/nongnu/"))
      package-archive-priorities
      '(("GNU ELPA"     . 20)
        ("MELPA"        . 15)
        ("ORG"          . 10)
        ("MELPA Stable" . 5)
        ("nongnu"       . 0)))
(package-initialize)

(defvar custom-bindings-map (make-sparse-keymap) 
  "Keymap for custom bindings.")

(use-package magit)

(use-package projectile
  :ensure t
  :init
  (when (file-directory-p "~/Documents/")
    (setq projectile-project-search-path '("~/Documents/Kompositionen"
					   "~/Documents/Code"
					   "~/Documents/DeterministicJitter"
					   "~/Documents/Reaper"
					   "~/Documenqts/Kompositionen-Video"
					   "~/Documents/Projekte"
					   "~/Documents/Utilities")))
  (setq projectile-switch-project-action #'treemacs)
  :bind-keymap
  ("s-p" . projectile-command-map)
  :config
  (projectile-mode))

(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)
  :custom
  (dashboard-startup-banner "/Users/philippneumann/.emacs.d/images/emacs-gnu.png")
  (dashboard-banner-logo-title nil)
  (dashboard-center-content t)
  (dashboard-show-shortcuts nil)
(dashboard-display-icons-p t)
  (dashboard-icon-type 'nerd-icons)
  (dashboard-set-heading-icons t)
  (dashboard-set-file-icons t)
  (dashboard-set-footer nil)
  (dashboard-projects-backend 'projectile)
  (dashboard-items '(
		     (recents . 5)
		     (projects . 5)
		     (bookmarks . 5)
		     (agenda . 24))))

(use-package treemacs
  :ensure t
  :bind ("C-x C-t" . treemacs)
  :after doom-themes
  :custom
  (treemacs-is-never-other-window t)
  (setq doom-themes-treemacs-theme "doom-colors")
  :hook
  ((treemacs-mode . treemacs-project-follow-mode)
   (treemacs-mode . (lambda () (display-line-numbers-mode 0)))))

(use-package treemacs-nerd-icons
  :ensure t
  :config
  (treemacs-load-theme "nerd-icons"))

(dolist (mode
         '(tool-bar-mode       ;; Remove toolbar
           scroll-bar-mode     ;; Remove scollbars
           menu-bar-mode    ;; Remove menu bar          
	   tooltip-mode))        ;; Remove tooltips
  (funcall mode 0))

(setq inhibit-startup-message           t       ;; No startup message
      inhibit-startup-echo-area-message t       ;; No startup message in echo area
      inhibit-startup-screen            t       ;; No default startup screen
      initial-major-mode                'fundamental-mode
      ring-bell-function                'ignore ;; No bell
      cursor-type 'box
	  visible-bell                        t                  ;; Visble bell
      display-time-default-load-average nil     ;; Don't show me load time
      scroll-margin                     0       ;; Space between top/bottom
      use-dialog-box                    nil)    ;; Disable dialog

(add-to-list 'default-frame-alist     '(fullscreen . maximized))
;; (add-hook 'window-setup-hook          'toggle-frame-fullscreen t)  ;; F11

(use-package spacious-padding
  :ensure t
  :hook (after-init . spacious-padding-mode))

(defun solaire-mode-real-buffer-custom-p ()
  "Return t if the current buffer is the dashboard or scratch, or is a real (file-visiting) buffer."
  (cond ((string= (buffer-name (buffer-base-buffer)) "*dashboard*") t)        
        ((buffer-file-name (buffer-base-buffer)) t)
        (t nil)))

(use-package solaire-mode
  :ensure t
  :hook (after-init . solaire-global-mode)
  :init (setq solaire-mode-real-buffer-fn #'solaire-mode-real-buffer-custom-p))

(use-package golden-ratio
  :ensure t
  :hook (after-init . golden-ratio-mode))

(add-to-list 'default-frame-alist '(internal-border-width . 16))

(add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))

(set-fringe-mode 10)                          ;; Set fringe width to 10

(setq-default fringes-outside-margins nil)
(setq-default indicate-buffer-boundaries nil) ;; Otherwise shows a corner icon on the edge
(setq-default indicate-empty-lines nil)       ;; Otherwise there are weird fringes on blank lines

(set-face-attribute 'header-line t :inherit 'default)

(when (eq system-type 'darwin)
  ; no title bar
  (add-to-list 'default-frame-alist '(undecorated-round . t))
  ; don't use proxy icon
  (setq ns-use-proxy-icon nil)
  ; don't show buffer name in title bar
  (setq frame-title-format ""))

(use-package rainbow-delimiters
  :hook (prog-mode-hook . rainbow-delimiters-mode))

(show-paren-mode t) ;; Highlight matching parentheses

;; Disable line numbers for specific modes
(dolist (mode '(prog-mode-hook
                csound-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 1))))

(defvar pvn/font-height 180)

(when (eq system-type 'darwin)
  (setq pvn/font-height 180))

(when (member "Inconsolata" (font-family-list))
  (set-face-attribute 'default nil :font "Inconsolata" :height pvn/font-height)
  (set-face-attribute 'fixed-pitch nil :family "Inconsolata"))

(when (member "Open Sans" (font-family-list))
  (set-face-attribute 'variable-pitch nil :family "Open Sans"))

(use-package mixed-pitch
  :defer t
  :hook ((org-mode   . mixed-pitch-mode)
         (LaTeX-mode . mixed-pitch-mode)))
