init.org
** Icons & Emojis

Add =nerd-icons=.

#+begin_src emacs-lisp
(use-package nerd-icons
  :custom
  (nerd-icons-font-family "Symbols Nerd Font Mono"))
#+end_src

and nerd-icons-completion

#+begin_src emacs-lisp
(use-package nerd-icons-completion
  :ensure t
  :after marginalia
  :config
  (nerd-icons-completion-mode)
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup)
  )
#+end_src

I also want to be able to display emojis with the Apple emoji font. I usually
don't use it, though, so I won't activate the global mode.

#+BEGIN_SRC emacs-lisp
(use-package emojify
  :config
  (when (member "Apple Color Emoji" (font-family-list))
    (set-fontset-font
      t 'symbol (font-spec :family "Apple Color Emoji") nil 'prepend)))
#+END_SRC

** Themes

I really like the =doom-themes= package, in particular their port of the [[https://www.nordtheme.com/][Nord theme]].

#+BEGIN_SRC emacs-lisp
(use-package doom-themes
  :config
  (doom-themes-visual-bell-config)  ;; Enable flashing mode-line on  errors
  ;; Enable custom neotree theme (all-the-icons must be installed!)
					;  (doom-themes-neotree-config)
  ;; or for treemacs users
  (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
  (doom-themes-treemacs-config)
  (set-face-background 'font-lock-comment-face nil)
  (setq doom-themes-enable-bold t     ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
    ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config)) 
#+END_SRC

And I don't want Emacs to ask me before changing to one of the themes I've used before.

#+begin_src emacs-lisp
(setq custom-safe-themes t)
#+end_src

*** Default Dark & Light Themes

My favourite dark theme is =doom-nord=. I haven't been able to find any light themes I really love, so I made South to act as Nord's bright counterpart. I'll set these two as my default dark and light themes respectively, and load the dark theme by default.

I'll also define a default accent colour, which is used in packages like =eval-sexp-fu=, or wherever I need to define a popping colour outside the theme itself.

#+begin_src emacs-lisp
(defvar pvn/default-dark-theme  'doom-vibrant)
(defvar pvn/default-light-theme 'doom-one-light)

(defvar pvn/default-dark-accent-colour  "SkyBlue4")
(defvar pvn/default-light-accent-colour "#CEE4F5")

(load-theme pvn/default-dark-theme t)
#+end_src

*** Changing Theme With System Theme

# [[https://github.com/LionyxML/auto-dark-emacs][auto-dark-emacs]] is a package for switching themes with the system theme. It works both on Linux and on MacOS.

# In the hook, I'll set the colour of the =eval-sexp-fu= flash to the =default-{dark/light}-accent-colour=.

# For some reason, my light themes leave some fragments that disappear when I load the theme twice, so I'll do that too.

# #+begin_src emacs-lisp
# (use-package autothemer
#   :defer t)

# (use-package auto-dark
#   :ensure t
#   :hook ((auto-dark-dark-mode
#           .
#           (lambda ()
#             (interactive)
#             (progn
#               (custom-set-faces
#                `(eval-sexp-fu-flash
#                  ((t (:background
#                       ,pvn/default-dark-accent-colour)))))
#               `(load-theme ,pvn/default-dark-theme t))))
#          (auto-dark-light-mode
#           .
#           (lambda ()
#             (interactive)
#             (progn
#               (custom-set-faces
#                `(eval-sexp-fu-flash
#                  ((t (:background
#                       ,pvn/default-light-accent-colour)))))
#               `(load-theme ,pvn/default-light-theme t)))))
#   :custom
#   (auto-dark-themes                   `((,pvn/default-dark-theme) (,pvn/default-light-theme)))
#   (auto-dark-polling-interval-seconds 5)
#   (auto-dark-allow-osascript          t)
#   :init (auto-dark-mode t))
# #+end_src

*** Conflict-Free Theme Changing

When changing themes interactively, as with =M-x load-theme=, the current custom theme is not disabled and this causes some weird issues. For example, the borders around posframes disappear. [[https://github.com/larstvei/dot-emacs?tab=readme-ov-file#advice][This snippet]] from Lars' config advises =load-theme= to always disable the currently enabled themes before switching.

#+begin_src emacs-lisp
(defun disable-custom-themes (theme &optional no-confirm no-enable)
  (mapc 'disable-theme custom-enabled-themes))

(advice-add 'load-theme :before #'disable-custom-themes)
#+end_src

** Mode Line
*** Column Number

Show current column number in mode line.

#+begin_src emacs-lisp
(column-number-mode t) ;; Show current column number in mode line
#+end_src

*** Doom Modeline

I prefere to use the Emaxs Doom Style Modeline.

#+begin_src emacs-lisp
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :config (column-number-mode 1)
  :custom
  (doom-modeline-height 20)
  (doom-modeline-window-width-limit nil)
  (doom-modeline-buffer-file-name-style 'truncate-with-project)
  (doom-modeline-minor-modes nil)
  (doom-modeline-enable-word-count nil)
  (doom-modeline-buffer-encoding nil)
  (doom-modeline-buffer-modification-icon t)
  (doom-modeline-env-python-executable "python")
  (doom-modeline-vcs-max-length 50))
#+end_src

** Text Display Modes
*** Olivetti

[[https://github.com/rnkn/olivetti][Olivetti]] is a minor mode for centering text. For convenience, I'll bind it to =C-c o= to activate/deactivate it on the fly.

#+BEGIN_SRC emacs-lisp
(use-package olivetti
  :defer t
  :bind (:map custom-bindings-map ("C-c o" . olivetti-mode))
  :config
  (setq olivetti-style t
		;;olivetti-body-width 120
		olivetti-minimum-body-width 72
		olivetti-recall-visual-line-mode-entry-state t))

(add-hook 'olivetti-mode-on-hook (lambda () (olivetti-set-width 0.65)))
#+END_SRC

*** Adaptive Wrap

In addition, I use [[https://elpa.gnu.org/packages/adaptive-wrap.html][adaptive-wrap]] to visually wrap lines.

#+begin_src emacs-lisp
(use-package adaptive-wrap
  :defer t
  :hook (visual-line-mode . adaptive-wrap-prefix-mode))
#+end_src

*** Writeroom Mode

[[https://github.com/joostkremers/writeroom-mode][Writeroom Mode]] gives you a distraction-free writing environment.

#+begin_src emacs-lisp
(use-package writeroom-mode
  :defer t)
#+end_src

*** Focus

 [[https://github.com/larstvei/Focus][Focus]] dims surrounding text in a semantic manner (sentences,
 paragraphs, sections, code blocks, etc.) making it easier to, well,
 focus. I find this especially helpful when editing LaTeX.

 #+begin_src emacs-lisp
 (use-package focus
   :defer t)
 #+end_src



*** Presentation Mode

 For presenting (e.g., code or Org mode buffers), it's useful to increase the
 font size, without necessarily increasing the size of everything else.

 #+begin_src emacs-lisp
 (use-package presentation
   :defer t
   :config
   (setq presentation-default-text-scale 2.5))
 #+end_src

* General Editing
** Built-In Options

#+BEGIN_SRC emacs-lisp
(global-visual-line-mode t) ;; Break lines instead of truncating them
(global-auto-revert-mode t) ;; Revert buffers automatically when they change
(recentf-mode            t) ;; Remember recently opened files
(savehist-mode           t) ;; Remember minibuffer prompt history
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq auto-revert-interval         1         ;; Refresh buffers fast
      auto-revert-verbose          nil       ;; Don't notify me about reverts
      echo-keystrokes              0.1       ;; Show keystrokes fast
      frame-inhibit-implied-resize 1         ;; Don't resize frame implicitly
      sentence-end-double-space    nil       ;; No double spaces
      recentf-max-saved-items      1000      ;; Show more recent files
      use-short-answers            t         ;; 'y'/'n' instead of 'yes'/'no' etc.
      save-interprogram-paste-before-kill t  ;; Save copies between programs
      history-length               25        ;; Only save the last 25 minibuffer prompts
      global-auto-revert-non-file-buffers t) ;; Revert Dired and other buffers
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq-default tab-width 4)  ;; Smaller tabs
#+END_SRC

** Smoother Scrolling

I want scrolling to be a *lot* slower than it is by default.

#+begin_src emacs-lisp
(setq scroll-conservatively            101
      mouse-wheel-follow-mouse         't
      mouse-wheel-progressive-speed    nil
      ;; Scroll 1 line at a time, instead of default 5
      ;; Hold shift to scroll faster and meta to scroll very fast
      mouse-wheel-scroll-amount        '(1 ((shift) . 3) ((meta) . 6)))

;; (Native) smooooooth scrolling
(setq pixel-scroll-precision-mode t)

(setq mac-redisplay-dont-reset-vscroll t
      mac-mouse-wheel-smooth-scroll    nil)
#+end_src

** Browse Kill Ring

Speaking of killing text, it's nice to be able to browse the kill ring.

#+begin_src emacs-lisp
(use-package browse-kill-ring
  :defer t)
#+end_src

** Auto-Saving

To avoid clutter, let's put all the auto-saved files into one and the same directory.

#+BEGIN_SRC emacs-lisp
(defvar emacs-autosave-directory
  (concat user-emacs-directory ".backupfiles/")
  "This variable dictates where to put auto saves. It is set to a
  directory called autosaves located wherever your .emacs.d/ is
  located.")

;; Sets all files to be backed up and auto saved in a single directory.
(setq backup-directory-alist
      `((".*" . ,emacs-autosave-directory))
      auto-save-file-name-transforms
      `((".*" ,emacs-autosave-directory t)))
#+END_SRC

** Text Editing Functions
*** Linebreaks for code editing

auto-fill is breaking the code at a specific column.

#+begin_src emacs-lisp
(setq-default auto-fill-function 'do-auto-fill)
(setq fill-column 80)
#+end_src

*** Undo/Redo

The default "undo until you can redo" behaviour of Emacs still trips me up.
[[https://github.com/emacsmirror/undo-fu][undo-fu]] lets me specify keys to "only undo" or "only redo".

#+begin_src emacs-lisp
(use-package undo-fu
  :defer t
  :bind (:map custom-bindings-map
              ("C-_" . undo-fu-only-undo)
              ("M-_" . undo-fu-only-redo)))
#+end_src

*** Move Lines

[[https://github.com/wyuenho/move-dup][move-dup]] provides bindings for moving and duplicating whole lines. It's super convenient.

#+begin_src emacs-lisp
(use-package move-dup
  :bind (:map custom-bindings-map
              ("C-M-<up>"   . move-dup-move-lines-up)
			  ("C-M-<down>" . move-dup-move-lines-down)
))
#+end_src

