init.org
* Completion

Emacs distinguishes between two different kinds of completion: complete-at-point  (text/code autocomplete) and completing-read (completion of Emacs commands, file names, etc.).

For completing-read, I use [[https://github.com/minad/vertico][Vertico]] and for completion-at-point at use [[https://company-mode.github.io/][Company]]. I also use a few complimentary packages that enhance the experience.

** Vertico

[[https://github.com/minad/vertico][Vertico]] is heart of this completion UI!

I'll use the function from [[http://whattheemacsd.com/setup-ido.el-02.html][this What the .emacs.d!? post]] which lets me type =~= at the Vertico prompt to go directly to the home directory. For use with Vertico, I add a call to =delete-minibuffer-contents= so that old path is cleared before starting the new file path (starting at =~/=).

#+begin_src emacs-lisp
(defun pvn/take-me-home ()
  (interactive)
  (if (looking-back "/" nil)
      (progn (call-interactively 'delete-minibuffer-contents) (insert "~/"))
    (call-interactively 'self-insert-command)))

(use-package vertico
  :defer t
  :bind (:map vertico-map ("~" . pvn/take-me-home))
  :config
  (vertico-mode)
  (vertico-multiform-mode)
  (setq read-extended-command-predicate       'command-completion-default-include-p
	vertico-cycle t ; allow cycling the buffer
	vertico-count                         10  ; Show more candidates
        read-file-name-completion-ignore-case t   ; Ignore case of file names
        read-buffer-completion-ignore-case    t   ; Ignore case in buffer completion
        completion-ignore-case                t)) ; Ignore case in completion
#+end_src

** Vertico Posframe

[[https://github.com/tumashu/vertico-posframe][vertico-posframe]] makes Vertico appear in a small child frame, instead of as a
traditional minibuffer. I like to have mine in the middle of the frame, with small fringes on either side.

I temporarily disable =vertico-posframe-mode= when searching with =consult=.
When selecting a search match, a preview is provided. That's kind of hard to see
with the posframe in the middle of the screen, so while searching I just use the
normal minibuffer.

#+begin_src emacs-lisp
(use-package vertico-posframe
    :init
    (setq vertico-posframe-parameters   
		  '((left-fringe  . 8)    ;; Fringes
            (right-fringe . 8))) 
    :config
    (vertico-posframe-mode 1)
    :custom
    (setq vertico-posframe-poshandler #'posframe-poshandler-frame-center))
#+end_src

The rounded frame corners (putting =(undecorated . nil)= in the =vertico-posframe-parameters=) look really nice on Mac OS.

** Orderless

And [[https://github.com/oantolin/orderless][Orderless]] is a package for a completion /style/, that matches multiple
regexes, in any order.

#+begin_src emacs-lisp
(use-package orderless
  :ensure t
  :config
  (setq completion-styles '(orderless basic partial-completion)
        completion-category-overrides '((file (styles basic partial-completion)))
        orderless-component-separator "[ |]"))
#+end_src

** Company

[[https://company-mode.github.io/][Company]] (COMPlete ANYthing) is a battle-tested completion package that works really well with LSP-mode.

#+begin_src emacs-lisp
(use-package company
  :config
  (setq company-idle-delay                 0.0
        company-minimum-prefix-length      2
        company-tooltip-align-annotations  t
        company-tooltip-annotation-padding 1
        company-tooltip-margin             1
        company-detect-icons-margin        'company-dot-icons-margin
	company-dabbrev-ignore-case nil  ;; Ignoriere Groß-/Kleinschreibung nicht
	company-dabbrev-downcase nil      ;; Erhalte die Originalschreibweise
	company-dabbrev-code-ignore-case nil ;; Auch für Code-Vervollständigungen case-sensitiv
	company-dabbrev-code-everywhere t)    ;; Suche nach Matches überall im Code
  (global-company-mode t))
#+end_src

* Search
** Imenu List

[[https://www.emacswiki.org/emacs/ImenuMode][Imenu]] is a built-in Emacs utility that gives you a minibuffer of the symbols in the current buffer and let's you jump to it. [[https://github.com/bmag/imenu-list][imenu-list]] is a nice package that gives you a new buffer with a navigable list of the functions, vars, etc. in your buffer, allowing you to quickly get an overview or jump to definition.

#+begin_src emacs-lisp
(use-package imenu-list
  :defer t
  :bind (:map custom-bindings-map
              ("M-g i" . imenu-list-smart-toggle)))
#+end_src

** Marginalia

[[https://github.com/minad/marginalia][Marginalia]] gives me annotations in the minibuffer.

#+begin_src emacs-lisp
(use-package marginalia
  :after vertico
  :custom
  (marginalia-max-relative-age 0)
  (marginalia-align 'right)
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :init
  (marginalia-mode))
#+end_src

* Misc. Packages
** More Characters

Integrated more characters e.g. western european ones.

#+begin_src emacs-lisp
(require 'iso-transl)
#+end_src

** Terminal Emulator
*** vterm

I like [[https://github.com/akermu/emacs-libvterm][vterm]] and usually just use that. I don't want it to double check with me
before killing an instance of the terminal, so I'll set it to just kill it.
I also really Lars' [[https://github.com/larstvei/dot-emacs#vterm][vterm functions]], so I'll use those as well. One is for
toggling the =vterm= buffer with the other open buffer, and another binds a
separate =vterm= instance to each =M-n= keystroke.

Lastly, deleting whole words doesn't work well in vterm by
default, so if anyone has a good tip for how to overwrite my custom bindings map
in just vterm, please do let me know :~)

#+begin_src emacs-lisp
(use-package vterm
  :defer t

  :preface
  (let ((last-vterm ""))
    (defun toggle-vterm ()
      (interactive)
      (cond ((string-match-p "^\\vterm<[1-9][0-9]*>$" (buffer-name))
             (goto-non-vterm-buffer))
            ((get-buffer last-vterm) (switch-to-buffer last-vterm))
            (t (vterm (setq last-vterm "vterm<1>")))))

    (defun goto-non-vterm-buffer ()
      (let* ((r "^\\vterm<[1-9][0-9]*>$")
             (vterm-buffer-p (lambda (b) (string-match-p r (buffer-name b))))
             (non-vterms (cl-remove-if vterm-buffer-p (buffer-list))))
        (when non-vterms
          (switch-to-buffer (car non-vterms)))))

	(defun switch-vterm (n)
      (let ((buffer-name (format "vterm<%d>" n)))
        (setq last-vterm buffer-name)
        (cond ((get-buffer buffer-name)
               (switch-to-buffer buffer-name))
              (t (vterm buffer-name)
                 (rename-buffer buffer-name))))))

  :bind (:map custom-bindings-map
              ("C-z" . toggle-vterm)
              ("M-1" . (lambda () (interactive) (switch-vterm 1)))
              ("M-2" . (lambda () (interactive) (switch-vterm 2)))
              ("M-3" . (lambda () (interactive) (switch-vterm 3)))
              ("M-4" . (lambda () (interactive) (switch-vterm 4)))
              ("M-5" . (lambda () (interactive) (switch-vterm 5)))
              ("M-6" . (lambda () (interactive) (switch-vterm 6)))
              ("M-7" . (lambda () (interactive) (switch-vterm 7)))
              ("M-8" . (lambda () (interactive) (switch-vterm 8)))
              ("M-9" . (lambda () (interactive) (switch-vterm 9))))
  :bind (:map vterm-mode-map
			  ("C-c C-c" . (lambda () (interactive) (vterm-send-key (kbd "C-c")))))

  :config
  ;; Don't query about killing vterm buffers, just kill it
  (defun my-vterm-kill-with-no-query (&rest _)
    "Set process query on exit flag to nil for vterm buffer."
    (set-process-query-on-exit-flag (get-buffer-process (current-buffer)) nil))

  (advice-add 'vterm :after #'my-vterm-kill-with-no-query))
#+end_src

** Better Help Buffers

# [[https://github.com/Wilfred/helpful][Helpful]] is an improvement on Emacs' built-in *help* buffer. It's more user-friendly and easier to read.

# #+BEGIN_SRC emacs-lisp
# (use-package helpful
#   :bind (:map custom-bindings-map
# 			  ("C-h f" . #'helpful-function)
# 			  ("C-h v" . #'helpful-variable)
# 			  ("C-h k" . #'helpful-key)
# 			  ("C-h x" . #'helpful-command)
# 			  ("C-h d" . #'helpful-at-point)
# 			  ("C-h c" . #'helpful-callable)))
# #+END_SRC

[[https://github.com/justbur/emacs-which-key][which-key]] shows you available keybindings in the minibuffer. When you've started
to enter a command, it will show you where you can go from there.

#+begin_src emacs-lisp
(use-package which-key
  :config
  (which-key-mode))
#+end_src

** Config Profiling

[[https://github.com/jschaf/esup][ESUP]] is a package for profiling your config. You can use it to shave precious seconds off your
startup time, which is useful to me because I keep closing it when I'm done with
a task and then immediately needing it again.

#+begin_src emacs-lisp
(use-package esup
  :defer t
  :config
  (setq esup-depth 0))
#+end_src

** httpd server

simple httpd

#+begin_src emacs-lisp
;;(set-exec-path-from-shell-PATH)
(setq httpd-root "/var/www")
#+end_src

* Org

[[https://orgmode.org/][Org Mode]] is a smart text system that is used for organising notes, literate programming, time management, and a wide variety of other use cases. I've been interested in switching from my previous note-taking app, Obsidian, to using Org and Roam (described in the next section).

Let's first make sure we're using Org. Note that I am leaving the last
parenthesis open, to include some options from the "Visuals" section inside the
=use-package= declaration for Org mode.

#+BEGIN_SRC emacs-lisp
(use-package org
  :defer t
#+END_SRC

** Agenda Settings
*** Capture Templates

*Note:* We are still in the =:config= section of the =use-package= declaration for Org
mode.


My Capture Templates

#+begin_src emacs-lisp
:config
  ;; Org-capture templates
  (setq org-capture-templates
        '(("t" "todo" entry (file+headline "~/Documents/Org/todo.org"
           "My ToDo List")
           "** TODO %? [/] %^t")
	  ("j" "journal" entry (file+datetree "~/Documents/Org/journal.org")
           "* %?\n%i\n")
          ("n" "notes" entry (file "~/Documents/Org/notes.org")
           "* %? %U \n%i\n")))
#+end_src

*** Habits Module

*Note:* We are still in the =:config= section of the =use-package= declaration for Org
mode.


Add the Habits Module to the org agenda.

#+begin_src emacs-lisp
:config
(add-to-list 'org-modules 'org-habit)
#+end_src

