init.el

(defun pvn/take-me-home ()
  (interactive)
  (if (looking-back "/" nil)
      (progn (call-interactively 'delete-minibuffer-contents) (insert "~/"))
    (call-interactively 'self-insert-command)))

(use-package vertico
  :defer t
  :bind (:map vertico-map ("~" . pvn/take-me-home))
  :config
  (vertico-mode)
  (vertico-multiform-mode)
  (setq read-extended-command-predicate       'command-completion-default-include-p
	vertico-cycle t ; allow cycling the buffer
	vertico-count                         10  ; Show more candidates
        read-file-name-completion-ignore-case t   ; Ignore case of file names
        read-buffer-completion-ignore-case    t   ; Ignore case in buffer completion
        completion-ignore-case                t)) ; Ignore case in completion

(use-package vertico-posframe
    :init
    (setq vertico-posframe-parameters   
		  '((left-fringe  . 8)    ;; Fringes
            (right-fringe . 8))) 
    :config
    (vertico-posframe-mode 1)
    :custom
    (setq vertico-posframe-poshandler #'posframe-poshandler-frame-center))

(use-package orderless
  :ensure t
  :config
  (setq completion-styles '(orderless basic partial-completion)
        completion-category-overrides '((file (styles basic partial-completion)))
        orderless-component-separator "[ |]"))

(use-package company
  :config
  (setq company-idle-delay                 0.0
        company-minimum-prefix-length      2
        company-tooltip-align-annotations  t
        company-tooltip-annotation-padding 1
        company-tooltip-margin             1
        company-detect-icons-margin        'company-dot-icons-margin
	company-dabbrev-ignore-case nil  ;; Ignoriere Groß-/Kleinschreibung nicht
	company-dabbrev-downcase nil      ;; Erhalte die Originalschreibweise
	company-dabbrev-code-ignore-case nil ;; Auch für Code-Vervollständigungen case-sensitiv
	company-dabbrev-code-everywhere t)    ;; Suche nach Matches überall im Code
  (global-company-mode t))

(use-package imenu-list
  :defer t
  :bind (:map custom-bindings-map
              ("M-g i" . imenu-list-smart-toggle)))

(use-package marginalia
  :after vertico
  :custom
  (marginalia-max-relative-age 0)
  (marginalia-align 'right)
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :init
  (marginalia-mode))

(require 'iso-transl)

(use-package vterm
  :defer t

  :preface
  (let ((last-vterm ""))
    (defun toggle-vterm ()
      (interactive)
      (cond ((string-match-p "^\\vterm<[1-9][0-9]*>$" (buffer-name))
             (goto-non-vterm-buffer))
            ((get-buffer last-vterm) (switch-to-buffer last-vterm))
            (t (vterm (setq last-vterm "vterm<1>")))))

    (defun goto-non-vterm-buffer ()
      (let* ((r "^\\vterm<[1-9][0-9]*>$")
             (vterm-buffer-p (lambda (b) (string-match-p r (buffer-name b))))
             (non-vterms (cl-remove-if vterm-buffer-p (buffer-list))))
        (when non-vterms
          (switch-to-buffer (car non-vterms)))))

	(defun switch-vterm (n)
      (let ((buffer-name (format "vterm<%d>" n)))
        (setq last-vterm buffer-name)
        (cond ((get-buffer buffer-name)
               (switch-to-buffer buffer-name))
              (t (vterm buffer-name)
                 (rename-buffer buffer-name))))))

  :bind (:map custom-bindings-map
              ("C-z" . toggle-vterm)
              ("M-1" . (lambda () (interactive) (switch-vterm 1)))
              ("M-2" . (lambda () (interactive) (switch-vterm 2)))
              ("M-3" . (lambda () (interactive) (switch-vterm 3)))
              ("M-4" . (lambda () (interactive) (switch-vterm 4)))
              ("M-5" . (lambda () (interactive) (switch-vterm 5)))
              ("M-6" . (lambda () (interactive) (switch-vterm 6)))
              ("M-7" . (lambda () (interactive) (switch-vterm 7)))
              ("M-8" . (lambda () (interactive) (switch-vterm 8)))
              ("M-9" . (lambda () (interactive) (switch-vterm 9))))
  :bind (:map vterm-mode-map
			  ("C-c C-c" . (lambda () (interactive) (vterm-send-key (kbd "C-c")))))

  :config
  ;; Don't query about killing vterm buffers, just kill it
  (defun my-vterm-kill-with-no-query (&rest _)
    "Set process query on exit flag to nil for vterm buffer."
    (set-process-query-on-exit-flag (get-buffer-process (current-buffer)) nil))

  (advice-add 'vterm :after #'my-vterm-kill-with-no-query))

(use-package which-key
  :config
  (which-key-mode))

(use-package esup
  :defer t
  :config
  (setq esup-depth 0))

;;(set-exec-path-from-shell-PATH)
(setq httpd-root "/var/www")

(use-package org
  :defer t

:config
  ;; Org-capture templates
  (setq org-capture-templates
        '(("t" "todo" entry (file+headline "~/Documents/Org/todo.org"
           "My ToDo List")
           "** TODO %? [/] %^t")
	  ("j" "journal" entry (file+datetree "~/Documents/Org/journal.org")
           "* %?\n%i\n")
          ("n" "notes" entry (file "~/Documents/Org/notes.org")
           "* %? %U \n%i\n")))

:config
(add-to-list 'org-modules 'org-habit)

:config
