init.org
*** Agenda Details

*Note:* We are still in the =:config= section of the =use-package= declaration for Org
mode.

Some Aggenda Detail settings

#+begin_src emacs-lisp
:config
  ;; Org-mode custom variables
  (setq org-agenda-start-with-log-mode t
        org-agenda-custom-commands
        '(("c" "Custom Agenda"
           ((agenda "" 
                    ((org-agenda-span 14)
                     (org-deadline-warning-days 7)
                     (org-agenda-skip-function
                      '(org-agenda-skip-entry-if 'category "habits"))))
            (tags-todo "+CATEGORY=\"habits\""
                       ((org-agenda-overriding-header "Habits")))
            (tags-todo "+CATEGORY=\"ToDos\""
                       ((org-agenda-overriding-header "To-Do Items"))))))
        calendar-week-start-day 1
        org-habit-graph-column 60
        org-agenda-start-with-habit t
        org-habit-show-all-today t
        org-habit-preceding-days 12
        org-habit-following-days 12
        org-agenda-span 14
        org-agenda-show-all-dates nil
        org-log-into-drawer "LOGBOOK"
        org-todo-keywords '((sequence "TODO" "IN-PROGRESS" "DONE"))
        org-agenda-include-diary t
        org-agenda-files '("~/Documents/Org/")
        org-adapt-indentation nil
        org-startup-with-inline-images t
        org-startup-folded t)

  (defun my/org-move-done-to-archive ()
  "Move the current entry to a specific headline when marked as DONE, 
  excluding entries with the property :STYLE: set to 'habit'."
  (when (and (string-equal org-state "DONE")  ; Prüft, ob der Status auf DONE gesetzt wurde
             (not (string-equal (org-entry-get nil "STYLE") "habit"))) ; Überprüft, ob das Property :STYLE: nicht 'habit' ist
    (let ((level (org-current-level))) ; Speichert die aktuelle Ebene der Überschrift
      (org-cut-subtree) ; Schneidet den aktuellen Eintrag aus
      (save-excursion
        (goto-char (point-min)) ; Gehe zum Anfang des Buffers
        (search-forward-regexp "^\\*+ Archive") ; Suche nach der Überschrift "Archive"
        (org-end-of-subtree t) ; Gehe zum Ende dieser Überschrift
        (newline-and-indent) ; Füge eine neue Zeile ein
        (org-paste-subtree level))))) ; Füge den Eintrag mit der korrekten Ebene ein

  (add-hook 'org-after-todo-state-change-hook #'my/org-move-done-to-archive)
#+end_src

*** Keybinding for Org-Files

*Note:* We are still in the =:config= section of the =use-package= declaration for Org
mode.

Some Aggenda Detail settings

#+begin_src emacs-lisp
:config
  ;; Keybindings for opening org files
  (defun open-journal ()
    (interactive)
    (find-file "~/Documents/Org/journal.org"))
  (global-set-key (kbd "C-c J") #'open-journal)

  (defun open-todo ()
    (interactive)
    (if (not (get-file-buffer "todo.org"))
        (find-file "~/Documents/Org/todo.org")
      (switch-to-buffer "todo.org")))
  (global-set-key (kbd "C-c T") #'open-todo)

  (defun open-notes ()
    (interactive)
    (find-file "~/Documents/Org/notes.org"))
  (global-set-key (kbd "C-c N") #'open-notes)

  ;; Additional Org-mode keybindings
  (global-set-key (kbd "C-c l") #'org-store-link)
  (global-set-key (kbd "C-c a") #'org-agenda)
  (global-set-key (kbd "C-c c") #'org-capture)
#+end_src

** Visuals
*** Text Centring

*Note:* We are still in the =:config= section of the =use-package= declaration for Org
mode.

I always want to center the text and enable linebreaks in Org. I've added
a hook to activate =olivetti-mode=, and =visual-fill-mode=
is always on.

#+begin_src emacs-lisp
:hook (org-mode . olivetti-mode)
#+end_src

#+begin_src emacs-lisp
:config 
(setq visual-fill-column-width 100
      visual-fill-column-center-text t)

(unless (package-installed-p 'visual-fill-column)
  (package-install 'visual-fill-column))

#+end_src

*** Fonts

*Note:* We are in the =:config= section of the =use-package= declaration for Org mode.

Set the sizes and fonts for the various headings.

#+begin_src emacs-lisp
  :config
  ;; Resize Org headings
  (custom-set-faces
  '(org-document-title ((t (:height 1.6))))
  '(outline-1          ((t (:height 1.25))))
  '(outline-2          ((t (:height 1.2))))
  '(outline-3          ((t (:height 1.15))))
  '(outline-4          ((t (:height 1.1))))
  '(outline-5          ((t (:height 1.1))))
  '(outline-6          ((t (:height 1.1))))
  '(outline-8          ((t (:height 1.1))))
  '(outline-9          ((t (:height 1.1)))))
#+END_src

*** Folded Startup

*Note:* We are still in the =:config= section of the =use-package= declaration for Org
mode.

In general, show me all the headings.

#+begin_src emacs-lisp
(setq org-startup-folded 'overview)
#+end_src

*** Decluttering

*Note:* We are still in the =:config= section of the =use-package= declaration for Org mode.

We'll declutter by adapting the indentation and hiding leading starts in headings. We'll also use [[https://orgmode.org/manual/Special-Symbols.html]["pretty entities"]], which allow us to
insert special characters LaTeX-style by using a leading backslash (e.g., =\alpha= to
write the greek letter alpha) and display ellipses in a condensed way.

#+begin_src emacs-lisp
  (setq org-adapt-indentation t
        org-hide-leading-stars t
        org-ellipsis "  ·")
#+end_src

For source code blocks specifically, I want Org to display the contents using
the major mode of the relevant language. I also want TAB to behave inside the
source code block like it normally would when writing code in that language.

#+begin_src emacs-lisp
  (setq org-src-fontify-natively t
        org-src-tab-acts-natively t
        org-edit-src-content-indentation 0)
#+end_src

Some Org options to deal with headers and TODO's nicely.

#+begin_src emacs-lisp
  (setq org-log-done                       t
        org-auto-align-tags                t
        org-tags-column                    -80
        org-fold-catch-invisible-edits     'show-and-error
        org-special-ctrl-a/e               t
        org-insert-heading-respect-content t)
#+end_src

Let's finally close the =use-package= declaration with a parenthesis.

#+begin_src emacs-lisp
)
#+end_src

*** Hide Emphasis Markers

Many people hide emphasis markers (e.g., =/.../= for italics, =*...*= for bold,
etc.) to have a cleaner visual look, but I got frustrated trying to go back and
edit text in these markers, as sometimes I would delete the markers itself or
write outside the markers. [[https://github.com/awth13/org-appear][org-appear]] is the solution to all my troubles. It
displays the markers when the cursor is within them and hides them otherwise,
making edits easy while looking pretty.

#+begin_src emacs-lisp
(use-package org-appear
  :commands (org-appear-mode)
  :hook     (org-mode . org-appear-mode)
  :config 
  (setq org-hide-emphasis-markers t)  ;; Must be activated for org-appear to work
  (setq org-appear-autoemphasis   t   ;; Show bold, italics, verbatim, etc.
        org-appear-autolinks      t   ;; Show links
        org-appear-autosubmarkers t)) ;; Show sub- and superscripts
#+end_src

*** Inline Images

Show inline images by default

#+begin_src haskell
(setq org-startup-with-inline-images t)
#+end_src

*** Variable Pitch

Make sure =variable-pitch-mode= is always active in Org buffers. I normally
wouldn't need this, since I use the =mixed-pitch= package in the font section, but
for some reason, it seems the header bullet in Org mode are affected by this.

#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'variable-pitch-mode)
#+end_src

*** htmli'ze code snippets

htmlize ist for syntax hithlighting exported org files with code snippets

#+begin_src emacs-lisp
;; Configure htmlize to be loaded only when org-mode is started
(use-package htmlize
  :ensure t
  :defer t  ;; Do not load htmlize immediately
  :hook (org-mode . (lambda () (require 'htmlize))))
#+end_src

*** Bullets

=org-superstar= styles some of my UI elements, such as bullets and special
checkboxes for TODOs.

#+begin_src emacs-lisp
(use-package org-superstar
  :after org
  :config
  (setq org-superstar-leading-bullet " ")
  (setq org-superstar-headline-bullets-list '("►" "◉" "●" "⚬" "●" "•"))
  (setq org-superstar-special-todo-items t) ;; Makes TODO header bullets into boxes
  (setq org-superstar-todo-bullet-alist '(("TODO"  . 9744)
                                          ("PROG"  . 9744)
                                          ("NEXT"  . 9744)
                                          ("WAIT"  . 9744)
                                          ("DONE"  . 9745)))
  :hook (org-mode . org-superstar-mode))
#+end_src

*** Right-Align Tags

Code snippet from [[https://www.reddit.com/r/emacs/comments/185e4k1/comment/kb39xvy/?utm_source=share&utm_medium=web2x&context=3][this Reddit post]]. It actually right-aligns tags, using
font-lock and the display property.

#+begin_src emacs-lisp
(add-to-list 'font-lock-extra-managed-props 'display)
(font-lock-add-keywords 'org-mode
                        `(("^.*?\\( \\)\\(:[[:alnum:]_@#%:]+:\\)$"
                           (1 `(face nil
                                     display (space :align-to (- right ,(org-string-width (match-string 2)) 3)))
                              prepend))) t)
#+end_src

** General Interaction
*** Disable Electric Indent Mode

The built-in electric indent mode is great - just not for Org mode.

#+begin_src emacs-lisp
(add-hook 'org-mode-hook #'(lambda () (electric-indent-local-mode -1)))
#+end_src

*** Opening Links

By default, when opening an Org-link, the current window is split into two. I'd like for the new window to replace the current one. To do this, we need to edit =org-link-frame-setup= and change the default cons =(file . find-file-other-window)= to =(file . find-file)=.

#+begin_src emacs-lisp :tangle no
(setq org-link-frame-setup
      '((vm      . vm-visit-folder-other-frame)
        (vm-imap . vm-visit-imap-folder-other-frame)
        (gnus    . org-gnus-no-new-news)
        (file    . find-file)
        (wl      . wl-other-frame)))
#+end_src

I'd also like to open links with =RET=.

#+begin_src emacs-lisp
(setq org-return-follows-link t)
#+end_src

