init.el
  ;; Org-mode custom variables
  (setq org-agenda-start-with-log-mode t
        org-agenda-custom-commands
        '(("c" "Custom Agenda"
           ((agenda "" 
                    ((org-agenda-span 14)
                     (org-deadline-warning-days 7)
                     (org-agenda-skip-function
                      '(org-agenda-skip-entry-if 'category "habits"))))
            (tags-todo "+CATEGORY=\"habits\""
                       ((org-agenda-overriding-header "Habits")))
            (tags-todo "+CATEGORY=\"ToDos\""
                       ((org-agenda-overriding-header "To-Do Items"))))))
        calendar-week-start-day 1
        org-habit-graph-column 60
        org-agenda-start-with-habit t
        org-habit-show-all-today t
        org-habit-preceding-days 12
        org-habit-following-days 12
        org-agenda-span 14
        org-agenda-show-all-dates nil
        org-log-into-drawer "LOGBOOK"
        org-todo-keywords '((sequence "TODO" "IN-PROGRESS" "DONE"))
        org-agenda-include-diary t
        org-agenda-files '("~/Documents/Org/")
        org-adapt-indentation nil
        org-startup-with-inline-images t
        org-startup-folded t)

  (defun my/org-move-done-to-archive ()
  "Move the current entry to a specific headline when marked as DONE, 
  excluding entries with the property :STYLE: set to 'habit'."
  (when (and (string-equal org-state "DONE")  ; Prüft, ob der Status auf DONE gesetzt wurde
             (not (string-equal (org-entry-get nil "STYLE") "habit"))) ; Überprüft, ob das Property :STYLE: nicht 'habit' ist
    (let ((level (org-current-level))) ; Speichert die aktuelle Ebene der Überschrift
      (org-cut-subtree) ; Schneidet den aktuellen Eintrag aus
      (save-excursion
        (goto-char (point-min)) ; Gehe zum Anfang des Buffers
        (search-forward-regexp "^\\*+ Archive") ; Suche nach der Überschrift "Archive"
        (org-end-of-subtree t) ; Gehe zum Ende dieser Überschrift
        (newline-and-indent) ; Füge eine neue Zeile ein
        (org-paste-subtree level))))) ; Füge den Eintrag mit der korrekten Ebene ein

  (add-hook 'org-after-todo-state-change-hook #'my/org-move-done-to-archive)

:config
  ;; Keybindings for opening org files
  (defun open-journal ()
    (interactive)
    (find-file "~/Documents/Org/journal.org"))
  (global-set-key (kbd "C-c J") #'open-journal)

  (defun open-todo ()
    (interactive)
    (if (not (get-file-buffer "todo.org"))
        (find-file "~/Documents/Org/todo.org")
      (switch-to-buffer "todo.org")))
  (global-set-key (kbd "C-c T") #'open-todo)

  (defun open-notes ()
    (interactive)
    (find-file "~/Documents/Org/notes.org"))
  (global-set-key (kbd "C-c N") #'open-notes)

  ;; Additional Org-mode keybindings
  (global-set-key (kbd "C-c l") #'org-store-link)
  (global-set-key (kbd "C-c a") #'org-agenda)
  (global-set-key (kbd "C-c c") #'org-capture)

:hook (org-mode . olivetti-mode)

:config 
(setq visual-fill-column-width 100
      visual-fill-column-center-text t)

(unless (package-installed-p 'visual-fill-column)
  (package-install 'visual-fill-column))

:config
;; Resize Org headings
(custom-set-faces
'(org-document-title ((t (:height 1.6))))
'(outline-1          ((t (:height 1.25))))
'(outline-2          ((t (:height 1.2))))
'(outline-3          ((t (:height 1.15))))
'(outline-4          ((t (:height 1.1))))
'(outline-5          ((t (:height 1.1))))
'(outline-6          ((t (:height 1.1))))
'(outline-8          ((t (:height 1.1))))
'(outline-9          ((t (:height 1.1)))))

(setq org-startup-folded 'overview)

(setq org-adapt-indentation t
      org-hide-leading-stars t
      org-ellipsis "  ·")

(setq org-src-fontify-natively t
      org-src-tab-acts-natively t
      org-edit-src-content-indentation 0)

(setq org-log-done                       t
      org-auto-align-tags                t
      org-tags-column                    -80
      org-fold-catch-invisible-edits     'show-and-error
      org-special-ctrl-a/e               t
      org-insert-heading-respect-content t)

)

(use-package org-appear
  :commands (org-appear-mode)
  :hook     (org-mode . org-appear-mode)
  :config 
  (setq org-hide-emphasis-markers t)  ;; Must be activated for org-appear to work
  (setq org-appear-autoemphasis   t   ;; Show bold, italics, verbatim, etc.
        org-appear-autolinks      t   ;; Show links
        org-appear-autosubmarkers t)) ;; Show sub- and superscripts

(add-hook 'org-mode-hook 'variable-pitch-mode)

;; Configure htmlize to be loaded only when org-mode is started
(use-package htmlize
  :ensure t
  :defer t  ;; Do not load htmlize immediately
  :hook (org-mode . (lambda () (require 'htmlize))))

(use-package org-superstar
  :after org
  :config
  (setq org-superstar-leading-bullet " ")
  (setq org-superstar-headline-bullets-list '("►" "◉" "●" "⚬" "●" "•"))
  (setq org-superstar-special-todo-items t) ;; Makes TODO header bullets into boxes
  (setq org-superstar-todo-bullet-alist '(("TODO"  . 9744)
                                          ("PROG"  . 9744)
                                          ("NEXT"  . 9744)
                                          ("WAIT"  . 9744)
                                          ("DONE"  . 9745)))
  :hook (org-mode . org-superstar-mode))

(add-to-list 'font-lock-extra-managed-props 'display)
(font-lock-add-keywords 'org-mode
                        `(("^.*?\\( \\)\\(:[[:alnum:]_@#%:]+:\\)$"
                           (1 `(face nil
                                     display (space :align-to (- right ,(org-string-width (match-string 2)) 3)))
                              prepend))) t)

(add-hook 'org-mode-hook #'(lambda () (electric-indent-local-mode -1)))

(setq org-return-follows-link t)
