init.el

(setq org-blank-before-new-entry '((heading . nil)
                                   (plain-list-item . nil)))

(setq org-export-use-babel       nil
      org-confirm-babel-evaluate nil)
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python     . t)
   (lisp . t)
   ))

(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("cc" . "src c"))
(add-to-list 'org-structure-template-alist '("cl" . "src lisp"))

(use-package ob-python
  :ensure nil
  :after (ob python)
  :config
  (setq org-babel-python-command python-shell-interpreter))

(use-package org-roam
  :ensure t
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "~/Documents/Org/RoamNotes")
  (org-roam-completion-everywhere t)
  (org-roam-capture-templates
   '(("d" "default" plain
      "* Overview\n* Content\n* Footer\n** Links\n%?* Deutsch :noexport:\n** Zusammenfassung\n** Ausführlich\n** Quellen\n"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
			 "#+title: ${title}\n#+date: %U\n#+hugo_lastmod: %U\n#+filetags: %^{Tags}\n#+hugo_section: %^{Hugo Section|🌰 Seeds|🌱
Sprouts|🌿 Plants}\n#+hugo_tags: noexport\n")
      :unnarrowed t    
      :use-old-frame t)
	 ("c" "code" plain
      "* Overview\n* Code\n* Footer\n** Links\n%?* Deutsch :noexport:\n** Zusammenfassung\n** Ausführlich\n** Quellen\n"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
			 "#+title: ${title}\n#+date: %U\n#+hugo_lastmod:
%U\n#+filetags: %^{Tags}\n#+hugo_section: %^{Hugo Section|🌰 Seeds|🌱
Sprouts|🌿 Plants}\n#+hugo_tags: noexport\n")
      :unnarrowed t    
      :use-old-frame t)
     ("t" "text-review" plain
      "* Links\n%?,* Quelle\nAutor:in: %^{Autor:in}\n
       Titel: ${title}\n
       Erschienen: %^{Jahr}\n
       * Zusammenfassung\n
       * Ausführlich\n
       * Zitate\n"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
			 "#+title: ${title}\n#+date: %U\n#+filetags: %^{Tags}\n")
      :unnarrowed t)
     ("p" "project" plain
      "* Links\n%?\n
       * Ziele\n* TODO [/]\n
       * Termine\n"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
			 "#+title: ${title}\n#+date: %U\n#+filetags: %^{Tags}\n")
      :unnarrowed t)))
  :bind
  (("C-c n l" . org-roam-buffer-toggle)
   ("C-c n f" . org-roam-node-find)
   ("C-c n i" . org-roam-node-insert)
   :map org-mode-map
   ("C-M-i" . completion-at-point))
  :config
  (org-roam-db-autosync-mode)
  (org-roam-setup)
)

(defun my/org-roam-capture-inbox ()
  (interactive)
  (org-roam-capture :node (org-roam-node-create)
                     :templates '(("i" "inbox" plain "* %? %U"
                                   :if-new (file+head "Inbox.org" "#+title: Inbox\n")))))

(global-set-key (kbd "C-c n b") #'my/org-roam-capture-inbox)

(setq org-roam-node-display-template
      (concat "${title:*} "
        (propertize "${tags:10}" 'face 'org-tag)))

(use-package websocket
  :ensure t
  :after org-roam)
(use-package org-roam-ui
  :ensure t
  :after org-roam ;; or :after org
  ;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;;         a hookable mode anymore, you're advised to pick something yourself
  ;;         if you don't care about startup time, use
  ;;  :hook (after-init . org-roam-ui-mode)
  :hook (org-roam-ui-mode . httpd-start)
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))
(global-set-key (kbd "C-c n u") (lambda () (interactive)
				  (org-roam-ui-mode) (httpd-start)))

(use-package ox-hugo
  :after org)

(setq time-stamp-active t
      time-stamp-start "#\\+hugo_lastmod:[ \t]*"
      time-stamp-end "$"
      time-stamp-format "\[%Y-%m-%d %a %H:%M\]")
(add-hook 'before-save-hook 'time-stamp)

(setq org-clock-sound "/Users/philippneumann/Documents/Org/Anhang/ClockSound.wav")
(defun my/play-sound (orgin-fn sound)
  (cl-destructuring-bind (_ _ file) sound
    (make-process :name (concat "play-sound-" file)
                  :connection-type 'pipe
                  :command `("afplay" ,file))))
(advice-add 'play-sound :around 'my/play-sound)

(use-package eldoc
  :defer t
  :config
  (global-eldoc-mode))

(electric-pair-mode 1)

(add-hook 'org-mode-hook (lambda ()
           (setq-local electric-pair-inhibit-predicate
                   `(lambda (c)
                  (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))
