init.org
*** LSP
 Use 'lsp-mode' to integrate Language Server Protocol (LSP) for code analysis, auto-completion, and more

#+begin_src emacs-lisp
(use-package lsp-mode
  :defer t
  :init (setq lsp-use-plists t)
  :hook ((c-mode                . lsp)
		 (python-mode           . lsp)
		 (clojure-mode          . lsp)
         (clojurec-mode         . lsp)
         (lsp-mode              . lsp-enable-which-key-integration)
         (typescript-mode       . lsp)
         (typescript-ts-mode    . lsp)
         (web-mode              . lsp))
  :bind (:map lsp-mode-map
              ("M-<return>" . lsp-execute-code-action)
              ("C-M-."      . lsp-find-references)
              ("C-c r"      . lsp-rename))
  :config
  (setq lsp-diagnostics-provider :flycheck)
  ;; Disable visual features
  (setq lsp-lens-enable                  nil  ;; No lenses

        ;; Enable code actions in the mode line
        lsp-modeline-code-actions-enable t
        lsp-modeline-code-action-fallback-icon "✦"

        ;; Limit raising of the echo area to show docs
        lsp-signature-doc-lines 3)
  (setq lsp-file-watch-threshold  1500)
  (setq lsp-format-buffer-on-save nil)

  (with-eval-after-load 'lsp-modeline
    (set-face-attribute 'lsp-modeline-code-actions-preferred-face nil
                        :inherit font-lock-comment-face)
    (set-face-attribute 'lsp-modeline-code-actions-face nil
                        :inherit font-lock-comment-face)))
#+end_src

My settings: 
#  #+begin_src emacs-lisp
# (use-package lsp-mode
#   :init
#   (setq lsp-keymap-prefix "C-c l")  ;; Set a custom keybinding prefix for LSP commands (e.g., C-c l for LSP commands)
#   :hook
#   ((python-mode . lsp)  ;; Activate LSP in Python mode for automatic language server integration
#    (c-mode . lsp))  ;; Activate LSP in C mode as well
#   :commands lsp)  ;; Define the command for starting LSP (will be triggered when 'lsp' is called)
# #+end_src

Use 'lsp-ui' for additional UI features for LSP, such as
documentation, diagnostics, etc.

#+begin_src emacs-lisp
(use-package lsp-ui
  :commands lsp-ui-mode  ;; Define the command for enabling the LSP UI mode
  :hook
  (python-mode . lsp-deferred)  ;; Start LSP in Python mode, but with a deferred startup (can be more responsive)
  :config
  (setq lsp-ui-doc-enable t  ;; Enable inline documentation popups
        lsp-ui-doc-delay 0.1  ;; Set a short delay (0.1 seconds) before showing documentation after cursor movement
        lsp-ui-doc-position 'at-point))  ;; Position the documentation popup at the point (the cursor location)
#+end_src

[[https://github.com/blahgeek/emacs-lsp-booster?tab=readme-ov-file][emacs-lsp-booster]] is a wrapper around your LSP server programs. In the README, the authors explain that it helps speed up LSP mode (and Eglot!) by converting JSON directly into elisp bytecode and by separating reading and writing into different threads.
#+begin_src emacs-lisp
(defun lsp-booster--advice-json-parse (old-fn &rest args)
  "Try to parse bytecode instead of json."
  (or
   (when (equal (following-char) ?#)
     (let ((bytecode (read (current-buffer))))
       (when (byte-code-function-p bytecode)
         (funcall bytecode))))
   (apply old-fn args)))
(advice-add (if (progn (require 'json)
                       (fboundp 'json-parse-buffer))
                'json-parse-buffer
              'json-read)
            :around
            #'lsp-booster--advice-json-parse)

(defun lsp-booster--advice-final-command (old-fn cmd &optional test?)
  "Prepend emacs-lsp-booster command to lsp CMD."
  (let ((orig-result (funcall old-fn cmd test?)))
    (if (and (not test?)                             ;; for check lsp-server-present?
             (not (file-remote-p default-directory)) ;; see lsp-resolve-final-command, it would add extra shell wrapper
             lsp-use-plists
             (not (functionp 'json-rpc-connection))  ;; native json-rpc
             (executable-find "emacs-lsp-booster"))
        (progn
          (when-let ((command-from-exec-path (executable-find (car orig-result))))  ;; resolve command from exec-path (in case not found in $PATH)
            (setcar orig-result command-from-exec-path))
          (message "Using emacs-lsp-booster for %s!" orig-result)
          (cons "emacs-lsp-booster" orig-result))
      orig-result)))
(advice-add 'lsp-resolve-final-command :around #'lsp-booster--advice-final-command)
#+end_src

*** C
Here are some functions and keybindings to work with C in Emacs.

Compile file from Buffer with =C-c c= 
#+begin_src emacs-lisp
(defun pvn/compile-c-file ()
  "compiles the current c file with gcc"
  (interactive)
  (if (buffer-file-name)
      (let* ((file-path (buffer-file-name))
             (file-without-extension (file-name-sans-extension (file-name-nondirectory file-path)))
             (command (format "gcc -Wall -Wextra -o %s %s"
							  file-without-extension file-path)))

        (compile command))
    (message "This buffer has no proper C-file")))

(add-hook 'c-mode-hook
          (lambda ()
            (local-set-key (kbd "C-x c") 'pvn/compile-c-file)))

#+end_src

#+begin_src emacs-lisp
(defun pvn/run-compiled-buffer-file ()
  "Runs the compiled version of the current C file."
  (interactive)
  (let* ((file-without-extension (file-name-sans-extension (file-name-nondirectory (buffer-file-name))))
         (exec-file (concat default-directory file-without-extension))
         (vterm-buffer-name "*vterm*"))
    (if (file-exists-p exec-file)
        (progn 
          (if (get-buffer vterm-buffer-name)
              (progn 
                (switch-to-buffer vterm-buffer-name)
                (vterm-send-string (concat "cd " (shell-quote-argument default-directory)))
                (vterm-send-return))
            (vterm))
          (vterm-send-string (concat "./" file-without-extension))
          (vterm-send-return))
      (message "Error: File %s does not exist!" exec-file))))

(add-hook 'c-mode-hook
          (lambda ()
            (local-set-key (kbd "C-x r") 'pvn/run-compiled-buffer-file)))

#+end_src
*** Python

Use 'python-mode' for Python file editing and configure LSP (Language Server Protocol)

#+begin_src emacs-lisp
(use-package python-mode
  :ensure nil  ;; We don't need to install 'python-mode' since it's built-in
  :hook
  (python-mode . lsp-deferred)  ;; Activate LSP deferred for Python files when entering python-mode
  :custom
  (python-shell-interpreter "python3"))  ;; Set the Python interpreter to 'python3' for the shell
#+end_src

Use 'pyvenv' for managing Python virtual environments in Emacs

#+begin_src emacs-lisp
(use-package pyvenv
  :config
  (pyvenv-mode 1))  ;; Enable pyvenv-mode to automatically handle virtual environments
#+end_src

Use 'lsp-pyright' for Python language server (Pyright)

#+begin_src emacs-lisp
(use-package lsp-pyright
  :custom
  (lsp-pyright-langserver-command "pyright")  ;; Set the command for the Pyright language server (can be 'pyright' or 'basedpyright')
  :hook
  (python-mode . (lambda ()  ;; When entering 'python-mode', activate LSP
                   (require 'lsp-pyright)  ;; Ensure 'lsp-pyright' is loaded
                   (lsp))))  ;; Start LSP for Python files, or use lsp-deferred for deferred startup
#+end_src

*** Lisp

Set the lisp interpreter to my sbcl version.

#+begin_src emacs-lisp
(setq inferior-lisp-program "/usr/local/bin/sbcl")
#+end_src

Use Sly as REPL for Lisp.

#+begin_src emacs-lisp
(use-package sly
  :defer t
  :hook
  (sly-mrepl-mode . (lambda () (display-line-numbers-mode 0))))

(eval-after-load 'sly
  `(define-key sly-prefix-map (kbd "M-h") 'sly-documentation-lookup))
#+end_src

Enable blinking of parentheses without deactivating them

#+begin_src emacs-lisp
(setq paren-dont-touch-blink t)
#+end_src

Load 'mic-paren' library and activate parentheses highlighting

#+begin_src emacs-lisp
(require 'mic-paren)
(paren-activate)
#+end_src

Highlight parentheses even if they are offscreen

#+begin_src emacs-lisp
(setq paren-highlight-offscreen t)
#+end_src

Make matching parentheses bold

#+begin_src emacs-lisp
(setq paren-match-face 'bold)
#+end_src

Set the background color of matching parentheses to the region's
background color.

#+begin_src emacs-lisp
(setq my/face-background-color (face-background 'region))
(set-face-background 'show-paren-match my/face-background-color)
#+end_src

Enable parenthesis handling for s-expressions

#+begin_src emacs-lisp
(setq paren-sexp-mode t)
#+end_src

