init.el

(use-package lsp-mode
  :defer t
  :init (setq lsp-use-plists t)
  :hook ((c-mode                . lsp)
		 (python-mode           . lsp)
		 (clojure-mode          . lsp)
         (clojurec-mode         . lsp)
         (lsp-mode              . lsp-enable-which-key-integration)
         (typescript-mode       . lsp)
         (typescript-ts-mode    . lsp)
         (web-mode              . lsp))
  :bind (:map lsp-mode-map
              ("M-<return>" . lsp-execute-code-action)
              ("C-M-."      . lsp-find-references)
              ("C-c r"      . lsp-rename))
  :config
  (setq lsp-diagnostics-provider :flycheck)
  ;; Disable visual features
  (setq lsp-lens-enable                  nil  ;; No lenses

        ;; Enable code actions in the mode line
        lsp-modeline-code-actions-enable t
        lsp-modeline-code-action-fallback-icon "✦"

        ;; Limit raising of the echo area to show docs
        lsp-signature-doc-lines 3)
  (setq lsp-file-watch-threshold  1500)
  (setq lsp-format-buffer-on-save nil)

  (with-eval-after-load 'lsp-modeline
    (set-face-attribute 'lsp-modeline-code-actions-preferred-face nil
                        :inherit font-lock-comment-face)
    (set-face-attribute 'lsp-modeline-code-actions-face nil
                        :inherit font-lock-comment-face)))

(use-package lsp-ui
  :commands lsp-ui-mode  ;; Define the command for enabling the LSP UI mode
  :hook
  (python-mode . lsp-deferred)  ;; Start LSP in Python mode, but with a deferred startup (can be more responsive)
  :config
  (setq lsp-ui-doc-enable t  ;; Enable inline documentation popups
        lsp-ui-doc-delay 0.1  ;; Set a short delay (0.1 seconds) before showing documentation after cursor movement
        lsp-ui-doc-position 'at-point))  ;; Position the documentation popup at the point (the cursor location)

(defun lsp-booster--advice-json-parse (old-fn &rest args)
  "Try to parse bytecode instead of json."
  (or
   (when (equal (following-char) ?#)
     (let ((bytecode (read (current-buffer))))
       (when (byte-code-function-p bytecode)
         (funcall bytecode))))
   (apply old-fn args)))
(advice-add (if (progn (require 'json)
                       (fboundp 'json-parse-buffer))
                'json-parse-buffer
              'json-read)
            :around
            #'lsp-booster--advice-json-parse)

(defun lsp-booster--advice-final-command (old-fn cmd &optional test?)
  "Prepend emacs-lsp-booster command to lsp CMD."
  (let ((orig-result (funcall old-fn cmd test?)))
    (if (and (not test?)                             ;; for check lsp-server-present?
             (not (file-remote-p default-directory)) ;; see lsp-resolve-final-command, it would add extra shell wrapper
             lsp-use-plists
             (not (functionp 'json-rpc-connection))  ;; native json-rpc
             (executable-find "emacs-lsp-booster"))
        (progn
          (when-let ((command-from-exec-path (executable-find (car orig-result))))  ;; resolve command from exec-path (in case not found in $PATH)
            (setcar orig-result command-from-exec-path))
          (message "Using emacs-lsp-booster for %s!" orig-result)
          (cons "emacs-lsp-booster" orig-result))
      orig-result)))
(advice-add 'lsp-resolve-final-command :around #'lsp-booster--advice-final-command)

(defun pvn/compile-c-file ()
  "compiles the current c file with gcc"
  (interactive)
  (if (buffer-file-name)
      (let* ((file-path (buffer-file-name))
             (file-without-extension (file-name-sans-extension (file-name-nondirectory file-path)))
             (command (format "gcc -Wall -Wextra -o %s %s"
							  file-without-extension file-path)))

        (compile command))
    (message "This buffer has no proper C-file")))

(add-hook 'c-mode-hook
          (lambda ()
            (local-set-key (kbd "C-x c") 'pvn/compile-c-file)))

(defun pvn/run-compiled-buffer-file ()
  "Runs the compiled version of the current C file."
  (interactive)
  (let* ((file-without-extension (file-name-sans-extension (file-name-nondirectory (buffer-file-name))))
         (exec-file (concat default-directory file-without-extension))
         (vterm-buffer-name "*vterm*"))
    (if (file-exists-p exec-file)
        (progn 
          (if (get-buffer vterm-buffer-name)
              (progn 
                (switch-to-buffer vterm-buffer-name)
                (vterm-send-string (concat "cd " (shell-quote-argument default-directory)))
                (vterm-send-return))
            (vterm))
          (vterm-send-string (concat "./" file-without-extension))
          (vterm-send-return))
      (message "Error: File %s does not exist!" exec-file))))

(add-hook 'c-mode-hook
          (lambda ()
            (local-set-key (kbd "C-x r") 'pvn/run-compiled-buffer-file)))

(use-package python-mode
  :ensure nil  ;; We don't need to install 'python-mode' since it's built-in
  :hook
  (python-mode . lsp-deferred)  ;; Activate LSP deferred for Python files when entering python-mode
  :custom
  (python-shell-interpreter "python3"))  ;; Set the Python interpreter to 'python3' for the shell

(use-package pyvenv
  :config
  (pyvenv-mode 1))  ;; Enable pyvenv-mode to automatically handle virtual environments

(use-package lsp-pyright
  :custom
  (lsp-pyright-langserver-command "pyright")  ;; Set the command for the Pyright language server (can be 'pyright' or 'basedpyright')
  :hook
  (python-mode . (lambda ()  ;; When entering 'python-mode', activate LSP
                   (require 'lsp-pyright)  ;; Ensure 'lsp-pyright' is loaded
                   (lsp))))  ;; Start LSP for Python files, or use lsp-deferred for deferred startup

(setq inferior-lisp-program "/usr/local/bin/sbcl")

(use-package sly
  :defer t
  :hook
  (sly-mrepl-mode . (lambda () (display-line-numbers-mode 0))))

(eval-after-load 'sly
  `(define-key sly-prefix-map (kbd "M-h") 'sly-documentation-lookup))

(setq paren-dont-touch-blink t)

(require 'mic-paren)
(paren-activate)

(setq paren-highlight-offscreen t)

(setq paren-match-face 'bold)

(setq my/face-background-color (face-background 'region))
(set-face-background 'show-paren-match my/face-background-color)

(setq paren-sexp-mode t)
