init.el

(use-package ansi-color
  :ensure t
  )
(defun colorize-compilation-buffer ()
  (let ((inhibit-read-only t))
    (ansi-color-apply-on-region (point-min) (point-max))))
(add-hook 'compilation-filter-hook 'colorize-compilation-buffer)
					;(add-hook 'compilation-filter-hook 'ansi-color-compilation-filter)
(use-package csound-mode
  :ensure nil
  :custom
  (csound-skeleton-default-sr 96000)
  (csound-skeleton-default-ksmps 16)
  (csound-skeleton-default-options "-d -odac -W -3")
  (csound-skeleton-default-additional-header "#include \"/Users/philippneumann/Documents/Code/Csound/UDOs/udo-collection.udo\"")
  :mode (("\\.csd\\'" . csound-mode)
         ("\\.orc\\'" . csound-mode)
         ("\\.sco\\'" . csound-mode)
         ("\\.udo\\'" . csound-mode))
  :load-path "~/.emacs.d/elpa/csound-mode/"
  :config
  (setq compilation-scroll-output t))

(define-key key-translation-map (kbd "M-1") (kbd "@"))
(define-key key-translation-map (kbd "M-2") (kbd "~"))
(define-key key-translation-map (kbd "M-3") (kbd "#"))
(define-key key-translation-map (kbd "M-5") (kbd "%"))
(define-key key-translation-map (kbd "M-7") (kbd "\\"))
(define-key key-translation-map (kbd "C-M-7") (kbd "|"))
(define-key key-translation-map (kbd "M-5") (kbd "["))
(define-key key-translation-map (kbd "M-6") (kbd "]"))
(define-key key-translation-map (kbd "M-8") (kbd "{"))
(define-key key-translation-map (kbd "M-9") (kbd "}"))

(define-minor-mode custom-bindings-mode
  "A mode that activates custom keybindings."
  :init-value t
  :keymap custom-bindings-map)
